Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: State is ubiquitous in data processing.
zh_cn: 状态在数据处理中无处不在，

source: State management
zh_cn: 状态管理

source: State management.
zh_cn: 状态管理。

source: State partitioning
zh_cn: 状态划分

source: State partitioning.
zh_cn: 状态划分。

source: State primitives expose the structure of the state to Flink and enable more efficient state accesses.
zh_cn: 通过这些状态原语可以为Flink状态指定不同的结构，从而实现更加高效的状态访问。

source: State recovery
zh_cn: 状态恢复

source: State recovery.
zh_cn: 状态恢复。

source: State, state consistency, and Flink’s checkpointing mechanism will be discussed in more detail in the following chapters.
zh_cn: 我们会在接下来的章节详细讨论状态、状态一致性以及Flink的checkpointing机制。

source: State, state consistency, and Flink’s checkpointing mech‐ anism will be discussed in more detail in the following chapters, but, for now, Figure 1-4 shows a stateful streaming Flink application.
zh_cn: 图1-4简单展示了Flink的状态化流式应用。有关状态、状态一致性以及Flink的检查点机制会在后面的章节详细讨论。

source: Stateful Operators and Applications
zh_cn: 状态化算子和应用

source: Stateful Operators and Applications.
zh_cn: 状态化算子和应用

source: Stateful Stream Processing
zh_cn: 状态化流处理

source: Stateful Stream Processing | 5
zh_cn: 状态化流处理 | 5

source: Stateful operators and user functions are common building blocks of stream process‐ ing applications.
zh_cn: 状态化算子及用户函数都是流处理应用中的常见组成部分。

source: Stateful operators use both incom‐ ing events and internal state to compute their output.
zh_cn: 状态化算子同时利用到来的事件和内部状态来计算输出。

source: Stateful operators use both incoming events and internal state to compute their output.
zh_cn: 状态化算子同时使用传入的事件和内部状态来计算输出。

source: Stateful stream processing applications are more challenging to parallelize and oper‐ ate in a fault tolerant manner because state needs to be efficiently partitioned and reli‐ ably recovered in the case of failures.
zh_cn: 状态化流处理应用在并行化和容错方面会麻烦很多，因为需要对状态进行高效划分并且在出错时需进行可靠的故障恢复。

source: Stateful stream processing applications are more challenging to parallelize and oper‐ ate in a fault-tolerant manner because state needs to be efficiently partitioned and reliably recovered in the case of failures.
zh_cn: 状态化流处理应用在并行化和容错方面会更具挑战性，因为它们需要对状态进行高效划分并且在出错时需进行可靠的故障恢复。

source: Stateful stream processing applications often ingest their incoming events from an event log.
zh_cn: 状态化流处理应用通常会从事件日志中读取事件记录。

source: Stateful stream processing has implications on many aspects of a stream processor such as failure recovery and memory management as well as the maintenance of streaming applications.
zh_cn: 状态化流处理会在故障恢复、内存管理以及流式应用维护等很多方面对流处理引擎产生影响。

source: Stateful stream processing in Flink is discussed in detail in “Implementing Stateful Functions” on
zh_cn: 有关Flink中状态化流处理的内容会在154页"实现状态化函数"一节详细讨论。

source: Stateful stream processing is an application design pattern for processing unbounded streams of events and is applicable to many different use cases in the IT infrastructure of a com‐ pany.
zh_cn: 作为一类面向无限事件流的应用设计模式，状态化流处理可用于公司IT基础设施中的很多用例。

source: Stateful stream processing is an application design pattern for processing unbounded streams of events and is applicable to many different use cases in the IT infrastructure of a company.
zh_cn: 作为一类面向无限事件流的应用设计模式，状态化流处理适用于公司IT基础设施中的很多用例场景。

source: Stateful transformations that are applied on a KeyedStream read from and write to state in the context of the currently processed event’s key.
zh_cn: 作用于KeyedStream的状态化转换可以对当前处理事件键值所对应上下文中的状态进行读写。

source: Stateless operations are easy to parallelize, since events can be processed independently of each other and of their arriving order.
zh_cn: 由于事件处理互不影响且与事件到来的时间无关，无状态的操作很容易并行化。

source: Stateless operations do not maintain any internal state.
zh_cn: 无状态的操作不会维持内部状态，

source: Statistics for a running job
zh_cn: 作业运行的统计信息

source: Stores a key-value map per key.
zh_cn: 每个键对应存储一个键值映射，

source: Stores a list of values per key.
zh_cn: 每个键对应存储一个值的列表。

source: Stores a single value of arbitrary type per key.
zh_cn: 每个键对应存储一个任意类型的值，

source: Stream API program essentially boils down to combining such transformations to create a dataflow graph that implements the application logic.
zh_cn: 完成一个DataStream API程序在本质上可以归结为：通过组合不同的转换来创建一个满足应用逻辑的Dataflow图。

source: Stream Processing Fundamentals
zh_cn: 流处理基础

source: Stream Processing Fundamentals.
zh_cn: 流处理基础

source: Stream Processing with Apache
zh_cn: 基于Apache Flink的流处理

source: Stream processing engines usually provide a set of built-in operations to ingest, trans‐ form, and output streams.
zh_cn: 流处理引擎通常会提供一系列内置操作来实现数据流的获取、转换以及输出。

source: Stream processing technology is becoming more and more popular with companies big and small because it provides superior solutions for many established use cases such as data analytics, ETL, and transactional applications, but also facilitates novel applications, software architectures, and business opportunities.
zh_cn: 流处理技术正受到越来越多不同规模公司的青睐，这是因为它不仅可以为很多现有场景提供更优的解决方案（例如数据分析、ETL以及事务性应用），还能催生很多新颖的应用、软件架构以及商业机会。

source: Stream processing technology is being rapidly adopted by companies and enterprises of any size because it provides superior solutions for many established use cases but also facilitates novel applications, software architectures, and business opportunities.
zh_cn: 而流处理技术本身也迅速在各种规模的公司和企业中普及，这是因为它不仅可以为现有用例提供更优的解决方案，更可催生很多新颖的应用、软件架构以及商业机会。

source: Stream processors like Flink also support event-time pro‐ cessing to produce correct and deterministic results and the ability to process large amounts of data in little time.
zh_cn: 诸如Flink之类的流处理引擎还需要支持事件时间处理，从而可以生成精准、确定的结果，并具备在短时间内处理大量数据的能力。

source: Stream processors of this generation made the lambda archi‐ tecture obsolete.
zh_cn: 这使得Lambda架构彻底沦为历史。

source: Stream processors of this generation made the lambda architecture obsolete.
zh_cn: 这使得Lambda架构彻底沦为历史。

source: Stream‐ ing jobs run for long periods of time, thus state might be collected over several days or even months.
zh_cn: 流式作业会运行较长时间，因此状态可能是数天甚至数月才收集而来。

source: StreamExecutionEnvironment and it takes the following values:
zh_cn: 时间特性是StreamExecutionEnvironment的一个属性，它可以接收以下值：

source: Streaming Analytics
zh_cn: 流式分析

source: Streaming analytics applications are commonly used for:
zh_cn: 流式分析应用常用于：

source: Streaming application with two stateful sources, two stateful tasks, and two stateless sinks
zh_cn: 拥有两个状态化数据源、两个状态化任务以及两个无状态数据汇的流式应用

source: Streaming applications are long-running and their workloads are often unpredicta‐ ble.
zh_cn: 流式应用通常都需要长时间运行，这就导致了它的工作负载往往难以预测。

source: Streaming applications are often designed to run continuously for months or years.
zh_cn: 流式应用经常会被设计成需要长年累月地连续运行。

source: Streaming applications are supposed to run continuously and must recover from fail‐ ures, such as failing machines or processes.
zh_cn: 连续运行的流式应用需要具备从（机器或进程）故障中恢复的能力，

source: Streaming applications are typically designed to run 24/7.
zh_cn: 流式应用通常都会设计成7×24小时运行，

source: Streaming applications need to exchange data in a pipelined fashion, i.e., each pair of TaskManagers maintains a permanent TCP connection to exchange data3.
zh_cn: 流式应用需要以流水线方式交换数据，即每对TaskManager之间都维护一个永久的TCP连接来交换数据3。

source: Streaming applications need to exchange data in a pipelined fashion—each pair of TaskManag‐ ers maintains a permanent TCP connection to exchange data.2 With a shuffle connec‐ tion pattern, each sender task needs to be able to send data to each receiving task.
zh_cn: 流式应用需要以流水线方式交换数据，因此每对TaskManager之间都要维护一个永久的TCP连接来执行数据交换2。在Shuffle连接模式下，每个发送端任务都需要向任意一个接收任务传输数据。

source: Streaming applications usually emit their results to some external system, such as Apache Kafka, a filesystem, or a database.
zh_cn: 流式应用通常都会把结果发送到某些外部系统，例如Apache Kafka，文件系统或数据库。

source: Streaming systems define their behavior in the pres‐ ence of failures by offering result guarantees.
zh_cn: 流处理系统通过不同的结果保障来定义故障时的行为。

source: Streaming systems define their behavior in the presence of failures by offering result guarantees.
zh_cn: 流处理系统通过不同的结果保障来定义故障时的行为。

source: StreamingFileSink Requires Checkpointing Be Enabled
zh_cn: StreamingFileSink需要检查点处于开启状态

source: StreamingFileSink provides end-to-end exactly-once guarantees for an application given that the application is configured with exactly-once checkpoints and all its
zh_cn: 假如应用配置了精确一次检查点，且它所有数据源都能在故障时重置，那么StreamingFileSink就可以提供端到端的一致性保障。

source: StreamingFileSink provides exactly-once output guarantees.
zh_cn: StreamingFileSink可以提供精确一次的输出保障。

source: StreamingFileSink simply incre‐ ments the file IDs.
zh_cn: StreamingFileSink只是单纯地对ID执行递增操作。

source: StreamingFileSink supports two modes of writing records to part files: row encod‐ ing and bulk encoding.
zh_cn: StreamingFileSink支持两种分块文件的写入模式：行编码（row encoding）和批量编码（bulk encoding）。

source: StreamingFileSink will never move files from pending into fin‐ ished state, if an application does not enable checkpointing.
zh_cn: 如果应用没有开启检查点，StreamingFileSink将永远不会把等待状态的文件变为完成状态。

source: Stream‐ ing jobs run for long periods of time, and thus state might be collected over several days or even months.
zh_cn: 流式作业通常会运行较长时间，因此状态可能是经过数天甚至数月才收集得到。

source: Sub‐ sets of an organization’s data are stored in multiple of these systems.
zh_cn: 一些机构的数据可能会同时存储在多个系统里。

source: Submitting a job to a Flink YARN session cluster
zh_cn: 向会话模式的Flink YARN集群提交作业

source: Submitting an application to a Flink standalone cluster
zh_cn: 向Flink独立集群提交应用

source: Subsequent transformations pro‐ cess the elements of all input streams.
zh_cn: 这样后续的转换操作就可以对所有输入流中的元素统一处理。

source: Subsequently, Flink’s ResourceManager requests containers from YARN’s ResourceManager and starts TaskManager pro‐ cesses.
zh_cn: 随后，Flink的ResourceManager会向YARN的ResourceManager申请容器并启动TaskManager进程。

source: Subsequently, it merges all windows with overlapping ranges.
zh_cn: 随后分配器会将所有范围存在重叠的窗口合并。

source: Subsequently, the task updates its event-time clock to be the minimum of all partition watermarks.
zh_cn: 随后，任务会把事件时间时钟调整为所有分区水位线中最小的那个值。

source: Subsequently, we showed you how to implement custom source and sink connectors, including WAL and 2PC sink connectors, providing detailed examples.
zh_cn: 随后，我们通过详细示例向你展示了如何实现自定义的数据源连接器以及数据汇连接器，其中主要包括基于WAL和2PC的数据汇连接器。

source: Such a
zh_cn: 摘要可能是一个计数值，一个累加和，至今所见事件的抽样，一个窗口缓冲，或是只保留了那些运行应用感兴趣属性的某种自定义数据结构。

source: Such a summary can be a count, a sum, a sample of the events seen so far, a window buffer, or a custom data structure that preserves some property of interest to the running application.
zh_cn: 这种摘要可能是一个数量值，一个累加值，一个对至今为止全部事件的抽样，一个窗口缓冲或是一个保留了应用运行过程中某些有价值信息的自定义数据结构。

source: Such an architecture implies that a separate system needs to be set up and maintained, which can be a major effort, especially if this needs to be a distributed system as well.
zh_cn: 为了实现该架构，我们需要搭建和维护一套独立的系统。它工作量可能非常大，尤其在系统同样是分布式的情况下。

source: Such records are called late records.
zh_cn: 我们称此类记录为迟到记录（late record）。

source: Summary
zh_cn: 总结

source: Summary | 15
zh_cn: 总结 | 15

source: Summary | 219
zh_cn: 总结 | 219

source: Summary | 69
zh_cn: 总结 | 69

source: Summary | 77
zh_cn: 总结 | 77

source: Supported Data Types
zh_cn: 支持的数据类型

source: Swift FS paths are identified by the swift:// scheme.
zh_cn: Swift FS路径协议是swift://。

source: System Architecture
zh_cn: 系统架构

source: System Architecture | 39
zh_cn: 系统架构 | 39

source: System Configuration
zh_cn: 系统配置

source: System Configuration | 239
zh_cn: 系统配置 | 239

source: System Configuration | 241
zh_cn: 系统配置 | 241

source: System Configuration | 243
zh_cn: 系统配置 | 243

source: System scope configuration options and their default values
zh_cn: 系统域的配置项和它们的默认值

source: TXN defines a transaction identifier that can be used to identify and recover a transaction after a failure.
zh_cn: TXN定义了可用于故障后事务识别与恢复的事务标识符的类型。

source: Table 10-1.
zh_cn: 表10-1，

source: Table 10-10.
zh_cn: 表10-10，

source: Table 10-11.
zh_cn: 表10-11，

source: Table 10-12.
zh_cn: 表10-12，

source: Table 10-13.
zh_cn: 表10-13，

source: Table 10-14.
zh_cn: 表10-14，

source: Table 10-15.
zh_cn: 表10-15，

source: Table 10-16 shows the REST call to rescale an application.
zh_cn: 表10-16展示了对应用进行扩缩容的REST调用。

source: Table 10-16.
zh_cn: 表10-16，

source: Table 10-17.
zh_cn: 表10-17，

source: Table 10-18.
zh_cn: 表10-18，

source: Table 10-19.
zh_cn: 表10-19

source: Table 10-2.
zh_cn: 表10-2，

source: Table 10-3.
zh_cn: 表10-3，

source: Table 10-4 shows the REST request to list all metrics that are collected for the Job‐ Manager.
zh_cn: 表10-4展示的REST请求可以列出JobManager中收集的全部指标。

source: Table 10-4.
zh_cn: 表10-4，

source: Table 10-5 shows the REST request to list all metrics that are collected for the Task‐ Managers.
zh_cn: 表10-5展示的REST请求可以列出TaskManager中收集的全部指标。

source: Table 10-5.
zh_cn: 表10-5，

source: Table 10-6.
zh_cn: 表10-6，

source: Table 10-7.
zh_cn: 表10-7，

source: Table 10-8.
zh_cn: 表10-8，

source: Table 10-9.
zh_cn: 表10-9，

source: Table 8-1 shows the end-to-end consistency guarantees for different types of source and sink connectors that can be achieved in the best case; depending on the imple‐ mentation of the sink, the actual consistency might be worse.
zh_cn: 表8-1展示了不同类型的数据源和数据汇接收器在最好的情况下能够实现的端到端的一致性。根据数据汇的具体实现，实际的一致性可能无法达到最佳。

source: Table 8-1.
zh_cn: 表8-1，

source: Table API and SQL for Relational Analysis
zh_cn: 用于关系型分析的Table API及SQL

source: Table of Contents
zh_cn: 目录

source: Tables 10-1, 10-2, and 10-3 show the REST requests to obtain infor‐ mation about a Flink cluster, such as the number of task slots, running and finished jobs, the configuration of the JobManager, or a list of all connected TaskManagers.
zh_cn: 表10-1，10-2和10-3所展示的REST请求可用来获取Flink集群信息，例如：任务槽的数量，正在运行和已结束的作业，JobManager的配置以及所有相连的TaskManager列表。

source: Tables 10-11, 10-12, and 10-13 show how to manage running applications using the REST API.
zh_cn: 表10-11、10-12和10-13展示了如何使用REST API管理正在运行的应用。

source: Tables 10-7, 10-8, and 10-9 show the REST endpoints to manage these JAR files.
zh_cn: 表10-7、10-8和10-9展示了用于管理这些JAR文件的REST端点。

source: Take a checkpoint by copying the state of each task to a remote, persistent stor‐ age.
zh_cn: 将所有任务的状态拷贝到远程持久化存储，生成检查点。

source: Take a look at the Flink docu‐ mentation to learn how to implement and register a custom filesystem.
zh_cn: 有关实现和注册自定义文件系统的内容请查阅Flink文档。

source: Take a look at the official documentation for details about how to access this informa‐ tion.
zh_cn: 获取这些信息的详细途径请查阅官方文档。

source: Take for example a rolling aggregation operator that outputs the current sum of all the events it has seen so far.
zh_cn: 以某个滚动聚合算子为例，它会输出至今所有看到的事件之和。

source: Take, for example, a rolling aggregation operator that outputs the current sum of all the events it has seen so far.
zh_cn: 以某个滚动聚合算子为例，假设它会输出至今为止所见到的全部事件之和。

source: Takes a savepoint of the application
zh_cn: 为指定应用生成一个保存点

source: Takes a savepoint, cancels the application, and restarts it with the new default parallelism from the savepoint Response
zh_cn: 生成一个保存点，取消应用，并将它以新的默认并行度从保存点中重启 响应

source: Taking a savepoint from an application and restoring an application from a savepoint
zh_cn: 为应用生成保存点和从保存点恢复应用

source: Taking and disposing of a savepoint
zh_cn: 生成和清除保存点

source: Task
zh_cn: 任务

source: Task Chaining
zh_cn: 任务链接

source: Task Execution
zh_cn: 任务执行

source: Task Failures
zh_cn: 任务故障

source: Task chaining can significantly reduce the communication costs between local tasks, but there are also cases when it makes sense to execute a pipeline without chaining.
zh_cn: 虽然任务链接可以有效地降低本地任务之间的通信开销，但有的流水线应用反而不需要启用它。

source: Task chaining can significantly reduce the communication costs between local tasks, however there are also cases when it makes sense to execute a pipeline without chain‐ ing.
zh_cn: 虽然任务链接可以有效地降低本地任务之间的通信开销，但并不意味着所有的流水线执行都要启用它。

source: Task chaining fuses the parallel tasks of two or more operators into a single task that is executed by a single thread.
zh_cn: 任务链接将两个或多个算子的并行任务融合在一起，从而可以让它们在同一线程中执行。

source: Task chaining is enabled by default in Flink.
zh_cn: Flink在默认情况下会开启任务链接。

source: Task failures
zh_cn: 任务故障

source: Task:
zh_cn: 任务：

source: TaskManager and job
zh_cn: TaskManager及作业

source: TaskManager failures
zh_cn: TaskManager故障

source: TaskManagers are the worker processes of Flink.
zh_cn: TaskManager是Flink的工作进程。

source: Tasks can register timers at the timer service to perform a computa‐ tion at a specific point in time in the future.
zh_cn: 这些定时器可由任务在时间服务内注册，并在将来的某个时间点执行计算。

source: Tasks checkpoint their state once all barriers have been received, then they forward the checkpoint barrier
zh_cn: 任务在收到全部分隔符后将状态存入检查点，然后向下游转发检查点分隔符

source: Tasks continue regular processing after the checkpoint barrier is forwarded
zh_cn: 任务在转发检查点分隔符后继续进行常规处理

source: Tasks have an internal time service that maintains timers and is activated when a water‐ mark is received.
zh_cn: 任务的内部时间服务（time service）会维护定时器（timer），并在接收到水位线时激活。

source: Tasks of operators that are in different slot-sharing groups are not exe‐ cuted by the same slots.
zh_cn: 属于不同处理槽共享组的算子，其任务会交由不同的处理槽执行。

source: Tasks of time-based opera‐ tors collect and process records with possibly unordered timestamps and finalize a computation when their event-time clock, which is advanced by received watermarks, indicates that no more records with relevant timestamps have to be expected.
zh_cn: 对基于时间算子的任务而言，其收集和处理的记录可能会包含乱序的时间戳。只有当它们的事件时间时钟（由接收的水位线驱动）指示不必再等那些包含相关时间戳的记录时，才会最终触发计算。

source: Tasks wait to receive a barrier on each input partition; records from input streams for which a barrier already arrived are buffered; all other records are regularly processed
zh_cn: 任务等待接收所有输入分区的分隔符，来自已接收分隔符输入分区的记录会被缓存，其他记录则按常规处理

source: Tasks with keyed state
zh_cn: 带有键值分区状态的任务

source: Tasks with operator state
zh_cn: 带有算子状态的任务

source: TextInputFormat reads text files line-wise (split by newline characters), subclasses of CsvInputFormat read files with comma- separated values, and AvroInputFormat reads files with Avro-encoded records.
zh_cn: TextInputFormat会按行（由换行符指定）读取文本文件，CsvInputFormat的子类可用来读取CSV（comma-separated values）文件，AvroInputFormat可以读取存有Avro编码格式记录的文件。

source: Thanks to the built-in logic of GenericWriteAheadSink, it is not difficult to imple‐ ment a sink that leverages a WAL.
zh_cn: 多亏了GenericWriteAheadSink的内部逻辑才让我们可以相对容易地实现基于WAL的数据汇。

source: That is because the number of tasks might change when an application is started with different parallelism.
zh_cn: 这是因为任务数目可能会随着应用启动时所指定的并行度而改变。

source: That is, after recovery, it should know whether an event update has already been reflected on the state or not.
zh_cn: 即在故障恢复后，引擎需要知道某个事件对应的更新是否已经反映到状态上。

source: That is, how long do we have to wait before we can be certain that we have received all events that happened before a certain point of time?
zh_cn: 换言之，我们需要等多久才能确定已经收到了所有发生在某个特定时间点之前的事件？

source: That is, the API calls that create stream sources and transformations do not immediately trigger any data processing.
zh_cn: 也就是说，那些创建数据源和转换操作的API调用不会当即触发任何数据处理，

source: That is, the processing of an event does not depend on any events seen in the past and no history is kept.
zh_cn: 即处理事件时无需依赖过去看到的事件，也不保存历史数据。

source: That is, throughput tells us how many events the system can process per time unit.
zh_cn: 它告诉我们系统每单位时间可以处理多少事件。

source: That is, we are concerned with what the application code sees as state value after recovering from a failure.
zh_cn: 也就是说，我们关注故障恢复后应用代码能够看到的状态值。

source: That is, you are primarily concerned with determining the peak throughput, i.e. the perfor‐ mance limit when your system is at its maximum load.
zh_cn: 换言之，首要关注点是确定峰值吞吐，即系统满负载时的性能上限。

source: That is, you are primarily concerned with determining the peak throughput—the perfor‐ mance limit when your system is at its maximum load.
zh_cn: 换言之，首要的关注点是确定峰值吞吐，即系统满负载时的性能上限。

source: That is, you can re-play a stream and analyze historic data as if events are happening in real-time.
zh_cn: 这意味着你可以通过重放数据流来分析历史数据，就如同它们是实时产生的一样。

source: That is, you can replay a stream and analyze historic data as if events are happening in real time.
zh_cn: 这意味着你可以通过重放数据流来分析历史数据，就如同它们是实时产生的一样。

source: That is, you will get the fastest service if you are the only customer in the coffee shop.
zh_cn: 也就是说，如果咖啡店只有你一名顾客，你将获得最快的服务。

source: That means each parallel instance of the function is responsible for a subrange of the key domain and maintains the corresponding state instances.
zh_cn: 这意味着每个函数的并行实例都会负责一部分键值域并维护相应的状态实例。

source: That’s it!
zh_cn: 就这么简单！

source: That’s it.
zh_cn: 就这么简单，

source: The -p 8081:8081 parameter of the first command maps port 8081 of the master container to port 8081 of the host machine to make the Web UI accessible from the
zh_cn: 第一个命令中的"-p 8081:8081"参数将主容器的8081端口映射到宿主机的8081端口，使得Flink Web UI能够从外部宿主机访问到。

source: The ./bin/ flink.bat script for the Windows command line provides only very limited functionality.
zh_cn: 针对Windows系统所提供的./bin/flink.bat脚本功能有限。

source: The ./bin/start-cluster.sh script starts a master process on the local machine and one or more TaskManagers on the local or remote machines.
zh_cn: ./bin/start-cluster.sh脚本会在本地机器上启动一个主进程，并在本地或远程机器上启动一个或多个TaskManager。

source: The ./flink-container/docker directory also contains a docker-compose.yml file to deploy a Flink application with docker-compose.
zh_cn: ./flink-container/docker目录还包含了一个docker-compose.yml文件，用于通过docker-compose部署Flink应用。

source: The 2PC protocol piggybacks on Flink’s existing checkpointing mechanism.
zh_cn: 2PC协议需要基于Flink已有的检查点机制来完成。

source: The Dispatcher runs across job executions and provides a REST interface to sub‐ mit applications for execution.
zh_cn: Dispatcher会跨多个作业运行，它提供了一个REST接口来提交要执行的应用。

source: The JobManager is the master process that controls the execution of a single application, i.e., each application is controlled by a different JobManager.
zh_cn: JobManager作为主进程，控制着单个应用的执行。换句话说，每个应用都由一个不同的JobManager掌控。

source: The broadcast strategy sends every data item to all parallel tasks of an operator.
zh_cn: 广播策略（broadcast strategy）会把数据项发往下游算子的全部并发任务。

source: The forward strategy sends data from a task to a receiving task.
zh_cn: 转发策略（forward strategy）在发送端任务和接收端任务之间进行一对一的数据传输。

source: The key-based strategy partitions data by a key attribute and guarantees that data items having the same key will be processed by the same task.
zh_cn: 基于键值的策略（key-based strategy）根据某一键值属性将数据分成多份并保证键值相同的数据项一定会交由同一个任务处理。

source: The random strategy uniformly distributes data items to operator tasks in order to evenly distribute the load across computing tasks.
zh_cn: 随机策略（random strategy）为了实现计算任务的负载均衡，会将数据均匀分配至算子的所有任务。

source: The Apache Software Foundation alone is the home of more than a dozen projects related to stream processing.
zh_cn: 仅Apache软件基金会一家就有十多个和流处理相关的应用。

source: The Apache Software Foundation alone is the home of more than a dozen projects that are related to stream processing.
zh_cn: 仅Apache软件基金会一家就有十多个和流处理相关的应用。

source: The Application Might Not Rescale
zh_cn: 应用扩缩容可能失败

source: The Architecture of Apache Flink
zh_cn: Apache Flink架构

source: The Architecture of Apache Flink.
zh_cn: Apache Flink架构

source: The BroadcastProcessFunction and KeyedBroadcastProcess Function differ from each other as well.
zh_cn: BroadcastProcessFunction和KeyedBroadcastProcessFunction本身也有所不同。

source: The BucketAssigner can be configured on the builder using the withBucketAssigner() method.
zh_cn: 我们可以使用构建器的withBucketAssigner()方法配置BucketAssigner。

source: The CLI client lets you retrieve and visualize query results in the command line, which makes it a great tool to try out and debug Flink SQL queries or run exploratory queries on streaming or batch data.
zh_cn: CLI客户端允许你在命令行中获取和可视化查询结果，这使它成为一个在流式或批式数据上调试Flink SQL查询或运行探索式查询的绝佳工具。

source: The CQL statements in Example 8-6 create a keyspace
zh_cn: 示例8-6中的CQL语句创建了一个"example"键空间以及该键空间下的"sensors"表。

source: The Cassandra sink builders for tuples, case classes, and rows require the specifica‐ tion of a CQL INSERT query.5 The query is configured using the CassandraSink Builder.setQuery() method.
zh_cn: 若是要创建针对元组、样例类或Row类型的Cassandra数据汇构建器，你需要提供一个CQL INSERT查询。5 该查询可以用CassandraSinkBuilder.setQuery()方法配置。
